// - Нам дано масив друзів let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"]; Потрібно зробити перевірку якщо
//   кількість елементів у масиві більше або дорівнює 3, то виводиться повідомлення про те, що це великий масив, в якому 3 і більше елементи.
//   Інакше слід вивести на екран повідомлення про те, що це маленький масив, в якому менше 3-х елементів.
let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"];
if (friends.length >= 3) {
    alert('Це великий масив, в якому  3 і більше елементи');
} else {
    alert('Це маленький масив, в якому менше 3-х елементів');
}

// ---------------------------------------------------------------------------------------------------------------------

// - Маємо 3 числа і між ними нам потрібно знайти те що посередині.
//   Знайти, яке з них є середнім (більше одного, але менше за інше). Перевірити, чи знаходиться перше число між двома іншими.
let first = 2,
    second = 22,
    third = 33,
    middle;  // Додаю цю змінну, щоб потім перевірити чи ПЕРШИЙ є середнім як питалося в завданні

if (first < second && first < third) {  // Першим if я відтинаю найменше, вкладеним if шукаю середнє
    if (second < third) {
        middle = second;
        console.log(`${middle} is a middle`);
    } else {
        middle = third;
        console.log(`${middle} is a middle`);
    }
} else if (second < first && second < third) {  // Першим if я відтинаю найменше, вкладеним if шукаю середнє
    if (first < third) {
        middle = first;
        console.log(`${middle} is a middle`);
    } else {
        middle = third;
        console.log(`${middle} is a middle`);
    }
} else if (third < first && third < second) {  // Першим if я відтинаю найменше, вкладеним if шукаю середнє
    if (first < second) {
        middle = first;
        console.log(`${middle} is a middle`);
    } else {
        middle = second;
        console.log(`${middle} is a middle`);
    }
}
// Перевірити, чи знаходиться перше число між двома іншими.
if (middle === first) {
    console.log('First is a middle');
} else {
    console.log('First is not a middle');
}

// ---------------------------------------------------------------------------------------------------------------------

// - Перепишіть конструкцію if з використанням умовного оператора '?':
// let result;
// if (a + b < 4) {
//     result = 'Мало';
// } else {
//     result = 'Багато';
// }
let a = 3,
    b = 4;
let result = a + b < 4 ? 'Мало' : 'Багато';
console.log(`result = ${result}`);

// ---------------------------------------------------------------------------------------------------------------------

// - Маємо будь-яке число від -100, 0, +100 потрібно перевірити яким є число: позитивним, негативним або нулем
//   напишіть це тернарним оператором
let num = -33;
let res = num > 0 && num < 100 ? 'позитивне' : num === 0 ? 'нулем' : 'негативне';
console.log(`Наше число є ${res}`);

// ---------------------------------------------------------------------------------------------------------------------

// - У нас є змінна test, якщо дорівнює true, виведіть 'Вірно', інакше виведіть 'Неправильно'.
//   Перевірте роботу скрипта при test, що дорівнює true, false. Напишіть два варіанти скрипта - з коротким записом(тернаркою)
let test = false;
if (test) {
    console.log('Вірно');
} else {
    console.log('Неправильно');
}

console.log(test ? 'Вірно' : 'Неправильно');  // Вивід тернаркою

// ---------------------------------------------------------------------------------------------------------------------

// - Використовуючи конструкцію if..else, напишіть код, який запитуватиме: „Яка «офіційна» назва JavaScript?“
//   Якщо користувач вводить «ECMAScript», то показати: «Правильно!», інакше – відобразити: «Не знаєте? ECMAScript!
let userValue = prompt('Яка «офіційна» назва JavaScript?');
if (userValue === 'ECMAScript') {
    alert('Правильно');
} else {
    alert('Не знаєте? ECMAScript!');
}

// ---------------------------------------------------------------------------------------------------------------------

// - У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
//   Користувач вводить номер квартири просто в змінні або через prompt('').
//   Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.

let numFlat = +prompt('Enter number of flat');
if (numFlat >= 1 && numFlat <= 20) {
    alert('First approach');
} else if (numFlat >= 21 && numFlat <= 48) {
    alert('Second approach');
} else if (numFlat >= 49 && numFlat <= 90) {
    alert('Third approach');
} else {
    alert('This number is not defined');
}

// ---------------------------------------------------------------------------------------------------------------------

// - Ми маємо змінну number в яку користувач задає числове значення, якщо змінна дорівнює 10 вивести повідомлення ВІРНО, якщо змінна не рівна 10 - тоді НЕВІРНО
let number = +prompt('Enter some number');
alert(number === 10 ? 'ВІРНО' : 'НЕВІРНО');

// ---------------------------------------------------------------------------------------------------------------------

// - Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
//   Змінна, яка характеризує температуру. Якщо температура від +10 до +22 вивести повідомлення що ми йдемо ВЧИТИСЯ.
//   Якщо інша температура, тоді виводимо повідомлення що сидимо вдома і вчимося ОНЛАЙН.
let temperature = +prompt('Enter some temperature');
alert(temperature >= 10 && temperature <= 22 ? 'Ми йдемо ВЧИТИСЯ' : 'Cидимо вдома і вчимося ОНЛАЙН');

// ---------------------------------------------------------------------------------------------------------------------

// - За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число від 1 до 5. І в залежності від введеного
//   числа нам дається приз. (Авто, Мото, Телефон, і т.д) і якщо число не підходить тоді вивести Повідомлення - що число не вірне ... .
let quiz = +prompt('Enter some number of [1;5]');
switch (quiz) {
    case 1:
        alert('You won car');
        break;
    case 2:
        alert('You won moto');
        break;
    case 3:
        alert('You won phone');
        break;
    case 4:
        alert('You won travel');
        break;
    case 5:
        alert('You won money');
        break;
    default:
        alert('This number is not defined');
}